title: Generic-Service Installation from non-system directory
description: Detects servicer installation from non-system directory
author: Kaspersky  
status: stable
tags:  
    - attack.privilege_escalation  
    - attack.persistence  
    - attack.t1543.003  
    - attack.execution  
    - attack.t1569.002  
    - attack.defense_evasion
    - attack.t1112
logsource:  
    category: registry_event  
    product: windows  
detection:  
    selection:  
        TargetObject|contains:  
            - 'HKLM\System\CurrentControlSet\Services\'  
            - 'HKLM\System\ControlSet001\Services\'  
            - 'HKLM\System\ControlSet002\Services\'
    filter1:  
        Details|re:
            - (?i).*?windows\\(system32|syswow64|winsxs)?.*
            - (?i).*?\\Program\sFiles(\s\(x86\))?\\.*
    filter2:  
        Image|endswith:  
            - '\sc.exe'  
            - '\powershell.exe'  
            - '\reg.exe'  
condition: selection and not filter*
falsepositives:  
    - unknown
level: high
