title: Generic-Hide a User Account via Registry
description: Hide a User Account via Registry
author: Kaspersky
status: stable
tags:
    - attack.defense_evasion
    - attack.t1564.002
    - attack.t1112
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith:
            - '\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist'
        Details: 'DWORD (0x00000000)'
    filter:
        ParentImage|contains:
            - '\seagull\bartender ultralite\'
            - '\topoo\client\nmdeputy.exe'
            - '\novell\zenworks'
            - '\lenovo\system update\'
    condition: selection and not filter
falsepositives:
    - Administrators activity
level: medium
