title: Generic-Enabling RDP via Registry
description: Detects registry modification to enable RDP
author: Kaspersky
status: stable
tags:
    - attack.lateral_movement
    - attack.t1021.001
    - attack.persistence
    - attack.t1133
    - attack.Defense Evasion
    - attack.t1112
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith:
            - '\Control\Terminal Server\WinStations\RDP-Tcp\UserAuthentication'
            - '\Control\Terminal Server\fDenyTSConnections'
        Details: 'DWORD (0x00000000)'
    condition: selection
falsepositives: Legitimate System Administrator actions
level: high
